; domain
(define (domain strips_log_y_1-domain)
 (:requirements :strips :typing)
 (:predicates (obj ?obj - object) (truck ?truck - object) (location ?loc - object) (airplane ?airplane - object) (city ?city - object) (airport ?airport - object) (at_ ?obj - object ?loc - object) (in ?obj1 - object ?obj2 - object) (in_city ?obj - object ?city - object))
 (:action load_truck
  :parameters ( ?obj - object ?truck - object ?loc - object)
  :precondition (and (obj ?obj) (truck ?truck) (location ?loc) (at_ ?truck ?loc) (at_ ?obj ?loc))
  :effect (and (not (at_ ?obj ?loc)) (in ?obj ?truck)))
 (:action load_airplane
  :parameters ( ?obj - object ?airplane - object ?loc - object)
  :precondition (and (obj ?obj) (airplane ?airplane) (location ?loc) (at_ ?obj ?loc) (at_ ?airplane ?loc))
  :effect (and (not (at_ ?obj ?loc)) (in ?obj ?airplane)))
 (:action unload_truck
  :parameters ( ?obj - object ?truck - object ?loc - object)
  :precondition (and (obj ?obj) (truck ?truck) (location ?loc) (at_ ?truck ?loc) (in ?obj ?truck))
  :effect (and (not (in ?obj ?truck)) (at_ ?obj ?loc)))
 (:action unload_airplane
  :parameters ( ?obj - object ?airplane - object ?loc - object)
  :precondition (and (obj ?obj) (airplane ?airplane) (location ?loc) (in ?obj ?airplane) (at_ ?airplane ?loc))
  :effect (and (not (in ?obj ?airplane)) (at_ ?obj ?loc)))
 (:action drive_truck
  :parameters ( ?truck - object ?loc_from - object ?loc_to - object ?city - object)
  :precondition (and (truck ?truck) (location ?loc_from) (location ?loc_to) (city ?city) (at_ ?truck ?loc_from) (in_city ?loc_from ?city) (in_city ?loc_to ?city))
  :effect (and (not (at_ ?truck ?loc_from)) (at_ ?truck ?loc_to)))
 (:action fly_airplane
  :parameters ( ?airplane - object ?loc_from - object ?loc_to - object)
  :precondition (and (airplane ?airplane) (airport ?loc_from) (airport ?loc_to) (at_ ?airplane ?loc_from))
  :effect (and (not (at_ ?airplane ?loc_from)) (at_ ?airplane ?loc_to)))
)

; problem
(define (problem strips_log_y_1-problem)
 (:domain strips_log_y_1-domain)
 (:objects
   package3 package2 package1 city5 city4 city3 city2 city1 truck5 truck4 truck3 truck2 truck1 plane2 plane1 city5_1 city4_1 city3_1 city2_1 city1_1 city5_2 city4_2 city3_2 city2_2 city1_2 - object
 )
 (:init (obj package3) (obj package2) (obj package1) (city city5) (city city4) (city city3) (city city2) (city city1) (truck truck5) (truck truck4) (truck truck3) (truck truck2) (truck truck1) (airplane plane2) (airplane plane1) (location city5_1) (location city4_1) (location city3_1) (location city2_1) (location city1_1) (airport city5_2) (location city5_2) (airport city4_2) (location city4_2) (airport city3_2) (location city3_2) (airport city2_2) (location city2_2) (airport city1_2) (location city1_2) (in_city city5_2 city5) (in_city city5_1 city5) (in_city city4_2 city4) (in_city city4_1 city4) (in_city city3_2 city3) (in_city city3_1 city3) (in_city city2_2 city2) (in_city city2_1 city2) (in_city city1_2 city1) (in_city city1_1 city1) (at_ plane2 city1_2) (at_ plane1 city2_2) (at_ truck5 city5_1) (at_ truck4 city4_1) (at_ truck3 city3_1) (at_ truck2 city2_1) (at_ truck1 city1_1) (at_ package3 city1_1) (at_ package2 city1_2) (at_ package1 city4_1))
 (:goal (and (at_ package3 city1_2) (at_ package2 city1_1) (at_ package1 city3_2)))
)

; plan
1. (load_truck package1 truck4 city4_1)
   deleted: (at_ package1 city4_1)
   added: (in package1 truck4)
   goals met: 0 of 3
2. (drive_truck truck4 city4_1 city4_2 city4)
   deleted: (at_ truck4 city4_1)
   added: (at_ truck4 city4_2)
   goals met: 0 of 3
3. (fly_airplane plane2 city1_2 city4_2)
   deleted: (at_ plane2 city1_2)
   added: (at_ plane2 city4_2)
   goals met: 0 of 3
4. (load_truck package3 truck1 city1_1)
   deleted: (at_ package3 city1_1)
   added: (in package3 truck1)
   goals met: 0 of 3
5. (drive_truck truck1 city1_1 city1_2 city1)
   deleted: (at_ truck1 city1_1)
   added: (at_ truck1 city1_2)
   goals met: 0 of 3
6. (load_truck package2 truck1 city1_2)
   deleted: (at_ package2 city1_2)
   added: (in package2 truck1)
   goals met: 0 of 3
7. (unload_truck package1 truck4 city4_2)
   deleted: (in package1 truck4)
   added: (at_ package1 city4_2)
   goals met: 0 of 3
8. (unload_truck package3 truck1 city1_2)
   deleted: (in package3 truck1)
   added: (at_ package3 city1_2)
   goals met: 1 of 3
9. (drive_truck truck1 city1_2 city1_1 city1)
   deleted: (at_ truck1 city1_2)
   added: (at_ truck1 city1_1)
   goals met: 1 of 3
10. (unload_truck package2 truck1 city1_1)
   deleted: (in package2 truck1)
   added: (at_ package2 city1_1)
   goals met: 2 of 3
11. (load_airplane package1 plane2 city4_2)
   deleted: (at_ package1 city4_2)
   added: (in package1 plane2)
   goals met: 2 of 3
12. (fly_airplane plane2 city4_2 city3_2)
   deleted: (at_ plane2 city4_2)
   added: (at_ plane2 city3_2)
   goals met: 2 of 3
13. (unload_airplane package1 plane2 city3_2)
   deleted: (in package1 plane2)
   added: (at_ package1 city3_2)
   goals met: 3 of 3
